src/Catalogs/ОСМИ_НастройкиСобытий/ОСМИ_НастройкиСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОСМИ_НастройкиСобытий</name>
  <attributes>
    <name>ОбъектКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолеОсновногоОтбора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поле</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабличнаяЧасть</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипРегистра</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПрограммы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Действие</name>
    <type>
      <types>EnumRef.ОСМИ_Действие</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстРассылки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗаголовка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПоля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Отборы</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonModules/ОСМИ_ПодпискиНаСобытия/Module.bsl
Процедура ПроведениеДокументовОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	СистемаВключена = ПолучитьФункциональнуюОпцию("ОСМИ_ПодсистемаВключена");
	Если НЕ СистемаВключена Тогда
		Возврат;
	КонецЕсли;       
	
	Если Источник.ДополнительныеСвойства.Свойство("ОСМИ_НеОбновлять") Тогда
		Если Источник.ДополнительныеСвойства.ОСМИ_НеОбновлять Тогда 
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	НастройкиСобытий.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.ОСМИ_НастройкиСобытий КАК НастройкиСобытий
	                      |ГДЕ
	                      |	НастройкиСобытий.ОбъектКонфигурации = &ОбъектКонфигурации
	                      |	И НастройкиСобытий.Использование");

	Запрос.УстановитьПараметр("ОбъектКонфигурации", Метаданные.НайтиПоТипу(ТипЗнч(Источник.Ссылка)).ПолноеИмя());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Выборка.Ссылка.ПолучитьОбъект().ОтработатьСобытие(Источник.Ссылка);	
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Процедура ЗаписьСправочникаПриЗаписи(Источник, Отказ) Экспорт
	
	СистемаВключена = ПолучитьФункциональнуюОпцию("ОСМИ_ПодсистемаВключена");
	Если НЕ СистемаВключена Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	НастройкиСобытий.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.ОСМИ_НастройкиСобытий КАК НастройкиСобытий
	                      |ГДЕ
	                      |	НастройкиСобытий.ОбъектКонфигурации = &ОбъектКонфигурации
	                      |	И НастройкиСобытий.Использование");

	Запрос.УстановитьПараметр("ОбъектКонфигурации", Метаданные.НайтиПоТипу(ТипЗнч(Источник.Ссылка)).ПолноеИмя());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Выборка.Ссылка.ПолучитьОбъект().ОтработатьСобытие(Источник);	
	КонецЦикла;	
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры
